---
kind: method
id: M:Autodesk.Revit.DB.ElementId.GetHashCode
source: html/64b122ce-0c09-ccd4-213d-b06ab6ee7748.htm
---
# Autodesk.Revit.DB.ElementId.GetHashCode Method

Gets the value of the id as hash code

## Syntax (C#)
```csharp
public override int GetHashCode()
```